src/cfe/archic41c_БСП.ТочкиИнтеграции/src/InformationRegisters/СвязиБизнесДоменов/СвязиБизнесДоменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиБизнесДоменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действия</name>
    <type>
      <types>EnumRef.ДействияПоАрхитектуре</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.БизнесДомены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.БизнесДомены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/ДействияПоАрхитектуре/ДействияПоАрхитектуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПоАрхитектуре</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Изменяется</name>
  </enumValues>
  <enumValues>
    <name>Исключается</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/СтатусБизнесДомена/СтатусБизнесДомена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусБизнесДомена</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Готово</name>
  </enumValues>
  <enumValues>
    <name>Отложено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Documents/АрхитектурноеРешение/АрхитектурноеРешение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АрхитектурноеРешение</name>
  <registerRecords>InformationRegister.СвязиБизнесДоменов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАрхитектурногоРешения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененияДоменов</name>
    <attributes>
      <name>БизнесДомен</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиДоменов</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>Приемник</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>Действия</name>
      <type>
        <types>EnumRef.ДействияПоАрхитектуре</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПотока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Интеграции</name>
    <attributes>
      <name>Интеграция</name>
      <type>
        <types>CatalogRef.Интеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Действия</name>
      <type>
        <types>EnumRef.ДействияПоАрхитектуре</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/CommonModules/ТочкиИнтеграцииСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу связей домена из регистра с отбором по организации (без исключенных связей)
//
// Параметры:
//	ДатаСреза - Дата
//  Организация	 - СправочникСсылка.Организации - организация
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки регистра сведений СвязиБизнесДоменов
//
Функция СвязиДоменовПоОрганизации(ДатаСреза, Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязиБизнесДоменовСрезПоследних.Организация КАК Организация,
	               |	СвязиБизнесДоменовСрезПоследних.Источник КАК Источник,
	               |	СвязиБизнесДоменовСрезПоследних.Приемник КАК Приемник,
	               |	СвязиБизнесДоменовСрезПоследних.ОписаниеПотока КАК ОписаниеПотока,
	               |	СвязиБизнесДоменовСрезПоследних.ОписаниеИзменения КАК ОписаниеИзменения,
	               |	СвязиБизнесДоменовСрезПоследних.Приоритет КАК Приоритет,
	               |	СвязиБизнесДоменовСрезПоследних.Действия КАК Действия
	               |ИЗ
	               |	РегистрСведений.СвязиБизнесДоменов.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК СвязиБизнесДоменовСрезПоследних
	               |ГДЕ
	               |	СвязиБизнесДоменовСрезПоследних.Действия <> ЗНАЧЕНИЕ(Перечисление.ДействияПоАрхитектуре.Исключается)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	ТаблицаРезультата = Результат.Выгрузить();
	
	Возврат ТаблицаРезультата;

КонецФункции

// Возвращает таблицу доменов организации
// Не входят отмененные и отложенные домены в список возвращаемых
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - организация
//  ДокументАрхитектурноеРешение - ДокументСсылка.АрхитектурныеРешения - документ в рамках которого сделаны изменения по домену (необязательный параметр)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* БизнесДомен - СправочникСсылка.БизнесДомены
//		* Изменяется - Булево - Истина, в случае если было изменение в документе "Архитектурные решения"
//		* Описание - Строка - описания архитектурных изменений по документу
//
Функция ДоменыОрганизации(Организация, ДокументАрхитектурноеРешение = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АрхитектурныеРешенияИзмененияДоменов.БизнесДомен КАК БизнесДомен,
	               |	АрхитектурныеРешенияИзмененияДоменов.ОписаниеИзменения КАК ОписаниеИзменения
	               |ПОМЕСТИТЬ ВТ_ИзменяемыеДоменыДокумента
	               |ИЗ
	               |	Документ.АрхитектурноеРешение.ИзмененияДоменов КАК АрхитектурныеРешенияИзмененияДоменов
	               |ГДЕ
	               |	АрхитектурныеРешенияИзмененияДоменов.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	БизнесДомены.Ссылка КАК БизнесДомен,
	               |	БизнесДомены.Владелец КАК Владелец,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИзменяемыеДоменыДокумента.БизнесДомен ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Изменяется,
	               |	ЕСТЬNULL(ВТ_ИзменяемыеДоменыДокумента.ОписаниеИзменения, """") КАК ОписаниеИзменения
	               |ПОМЕСТИТЬ ВТ_ДоменыСУчетомАрхРешения
	               |ИЗ
	               |	Справочник.БизнесДомены КАК БизнесДомены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзменяемыеДоменыДокумента КАК ВТ_ИзменяемыеДоменыДокумента
	               |		ПО (ВТ_ИзменяемыеДоменыДокумента.БизнесДомен = БизнесДомены.Ссылка)
	               |ГДЕ
	               |	БизнесДомены.Владелец.Организация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоменыСУчетомАрхРешения.БизнесДомен КАК БизнесДомен,
	               |	ВТ_ДоменыСУчетомАрхРешения.Владелец КАК Владелец,
	               |	ВТ_ДоменыСУчетомАрхРешения.Изменяется КАК Изменяется,
	               |	ВТ_ДоменыСУчетомАрхРешения.ОписаниеИзменения КАК ОписаниеИзменения
	               |ИЗ
	               |	ВТ_ДоменыСУчетомАрхРешения КАК ВТ_ДоменыСУчетомАрхРешения
	               |ГДЕ
	               |	(ВТ_ДоменыСУчетомАрхРешения.Изменяется
	               |			ИЛИ НЕ ВТ_ДоменыСУчетомАрхРешения.Изменяется
	               |				И НЕ ВТ_ДоменыСУчетомАрхРешения.БизнесДомен.СтатусЗапуска В (ЗНАЧЕНИЕ(Перечисление.СтатусБизнесДомена.Отложено), ЗНАЧЕНИЕ(Перечисление.СтатусБизнесДомена.Отменено)))";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументАрхитектурноеРешение);
	
	Результат = Запрос.Выполнить();
	ТаблицаРезультата = Результат.Выгрузить();
	
	Возврат ТаблицаРезультата;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
